app/controllers/chat_controller.rb

SELECT * FROM `chats` WHERE (`chats`.`to` = 'Steve' AND `chats`.`recd` = 0) ORDER BY id ASC
UPDATE `chats` SET `recd` = 1 WHERE `id` = 1
---
  def chat_heartbeat
    items = []
    Chat.find(:all, :conditions => {:to => session[:username], :recd => 0}, :order => 'id ASC').each do |chat|
      items = session[:chat_history][chat.from] if session[:open_chat_boxes][chat.from].nil? and session[:chat_history][chat.from]
      chat.message = sanitize(chat.message)

      items << {:s => 0, :f => chat.from, :m => chat.message}

      session[:chat_history][chat.from] = [] if session[:chat_history][chat.from].nil?

      session[:chat_history][chat.from] << {:s => 0, :f => chat.from, :m => chat.message}

      session[:ts_chat_boxes][chat.from] = nil

      session[:open_chat_boxes][chat.from] = chat.sent
      chat.recd = 1
      chat.save!

INSERT INTO `chats` (`sent`, `recd`, `from`, `to`, `message`) VALUES('2010-07-26 21:12:28', 0, 'Steve', 'Dave', 'a')
---
  def send_chat
    from = session[:username]
    to = params[:to]
    message = params[:message]
    session[:open_chat_boxes][to] = DateTime.now.strftime("%Y-%m-%d %H:%M:%S")
    messagesan = sanitize(message)
    session[:chat_history][to] = [] if session[:chat_history][to].nil?
    session[:chat_history][to] << {:s => 1, :f => "{#{to}}", :m => "#{messagesan}"}